import 'package:finacial_planner/components/instruments/instyment.dart';
import 'package:flutter/material.dart';

class ListInstuments extends StatefulWidget {
  const ListInstuments({Key? key}) : super(key: key);

  @override
  State<ListInstuments> createState() => _ListInstumentsState();
}

class _ListInstumentsState extends State<ListInstuments> {
  @override
  Widget build(BuildContext context) {
    return ListView(
      children: const [
        Instrument(
          tem: 'Актив.',
          mean: [
            'Матеріальні цінності, використання яких, як очікується, приведе до отримання економічних вигод у майбутньому.',
          ],
        ),
        Instrument(
          tem: 'Пасив.',
          mean: [
            'Протилежно активу, сукупність усіх зобов"язань. Простими словами те, що витрачає фінанси.',
          ],
        ),
        Instrument(
          tem: 'Активний дохід.',
          mean: [
            'Простими словами те, що приносить дохід від продажу товарів та послуг.',
          ],
        ),
        Instrument(
          tem: 'Пасивний дохід.',
          mean: [
            'Це дохід, який не залежить від щоденної діяльностіv, наприклад, що отримується від фінансових активів. Пасивний дохід є складовою та органічною частиною такого поняття як фінансова незалежність. Простими словами приносить дохід, без вашого активного включення в процес',
          ],
        ),
        Instrument(
          tem: 'Диверсифікація.',
          mean: [
            'Розподіл інвестицій і ризиків з різних ринків, фінансових інструментів і стратегій торгівлі. Простими словами не зберігати всі яйця в одній корзині.',
          ],
        ),
        Instrument(
          tem: 'Рентабельність.',
          mean: [
            'Це співвідношення прибутку і витрат.',
          ],
        ),
        Instrument(
          tem: 'Кредит.',
          mean: [
            'Грошові кошти, які надаються особі за угодою на умовах повернення.\n',
            'Існують прості та складні відсотки.\n',
            'Якщо відсотки не виплачуються відразу ж після їхнього нарахування, а приєднуються до основної суми, збільшується нарахування.\n',
            'Потрібно зважити плюси та мінуси кредита.\n',
            'Це можливість та водночас обов’язок.\n',
            'Своя квартира чи оренда.\n',
            'Своє авто чи громадський транспорт.\n',
            'Новий телефон або стара техніка.\n',
            'Якщо займати кошти, то тільки ті які ви зможете повернути і які принесуть користь.\n',
          ],
        ),
      ],
    );
  }
}
