import 'package:finacial_planner/components/beliefs/belief.dart';
import 'package:flutter/material.dart';

class ListBeliefs extends StatefulWidget {
  const ListBeliefs({Key? key}) : super(key: key);

  @override
  State<ListBeliefs> createState() => _ListBeliefsState();
}

class _ListBeliefsState extends State<ListBeliefs> {
  @override
  Widget build(BuildContext context) {
    return ListView(
      children: const [
        Belief(
          attitude: 'Негативні переконання до грошей:',
          episode: [
            'Гроші не приносять щастя.',
            'Я заробляю недостатньо.',
            'Не вдається заощаджувати.',
            'Усе дуже дороге.',
            'Не можу оплатити рахунки.',
            'Не вдається відкладати кошти на пенсію.',
            'Важко розставатися з грошима.',
            'Соромно брати з людей великі гроші.',
            'Гроші це зло.',
          ],
        ),
        Belief(
          attitude: 'Позитивне відношення до грошей:',
          episode: [
            'Гроші – важлива частина мого життя, вони дають мені можливість досягти того, чого я дійсно бажаю.',
            'Гроші дають мені відчуття фінансової безпеки',
            'Я вартий мати багато грошей і насолоджуватися ними.',
            'Я знаю скільки коштує моя праця, я чудовий професіонал і люди готові достойно оплачувати мої товари і послуги.',
            'Гроші можуть працювати на мене.',
            'В мене можуть бути банківські та інші види заощаджень.',
            'Прибуток може збільшуватися в будь-який час.',
            'Витрачати гроші можна розумно.',
            'Якщо зараз тимчасове зниження фінансових доходів – це лише етап, який я пройду і підвищу свій достаток.',
            'Грошей вистачає.',
            'Я платоспроможний',
            'Я дбаю про вихід на пенсію.',
            'Кожна витрачена гривня приносить мені особливе задоволення.',
            'Я поступово і впевнено рухаюсь до своїх цілей.',
            'Я сам створюю своїми думками і діями прекрасне майбутнє для себе, своєї сім’ї, організації.',
            'Не важливо, як поводилися з грошима в вашій родині, важливо, як зараз ви поводитесь з грішми!',
          ],
        ),
      ],
    );
  }
}
